{
  "title": "Mapa Mental de Computación Cuántica",
  "root": "Computación Cuántica",
  "root-details": "Una guía interactiva al mundo de la computación cuántica, desde los principios fundamentales hasta las aplicaciones de vanguardia. Subtítulo: Desbloqueando la Imaginación de la Naturaleza.",
  "foundations": "Fundamentos de la Computación Cuántica",
  "foundations-details": "",
  "qubits": "Qubits",
  "qubits-details": "La unidad básica de información cuántica. Puede existir en una superposición de dos estados, 0 y 1. A menudo se visualiza en una esfera de Bloch.",
  "circuit-model": "Modelo de Circuitos Cuánticos",
  "circuit-model-details": "Un modelo para la computación cuántica donde las líneas horizontales (cables) representan qubits, y se aplican compuertas. Se lee de izquierda a derecha.",
  "gates": "Compuertas Cuánticas",
  "gates-details": "Operaciones sobre qubits. Ejemplos incluyen Hadamard (H), Pauli-X, Y, Z, CNOT y Toffoli. Las compuertas universales pueden crear cualquier operación cuántica.",
  "entanglement": "Entrelazamiento",
  "entanglement-details": "Un fenómeno de la mecánica cuántica donde los qubits están vinculados de tal manera que sus destinos están entrelazados, independientemente de la distancia. Ejemplo: estado de Bell √1/2(|00⟩ + |11⟩).",
  "measurement": "Mediciones",
  "measurement-details": "El proceso de extraer información clásica de un estado cuántico, lo que colapsa la superposición. La probabilidad de medir el estado |𝜑⟩ de |𝜓⟩ es |⟨𝜑|𝜓⟩|².",
  "dirac-notation": "Notación de Dirac",
  "dirac-notation-details": "Una notación estándar para estados cuánticos. |𝜓⟩ (ket) para vectores de estado, ⟨𝜑| (bra) para vectores fila, y ⟨𝜑|𝜓⟩ para productos internos.",
  "algorithms": "Algoritmos Cuánticos",
  "algorithms-details": "",
  "optimization": "Optimización Cuántica",
  "optimization-details": "",
  "ising-qubo": "Modelo de Ising & QUBO",
  "ising-qubo-details": "Métodos para formular problemas de optimización complejos (como Max-Cut) en un formato resoluble por computadoras cuánticas.",
  "annealing": "Recocido Cuántico",
  "annealing-details": "Una metaheurística para encontrar el mínimo global de una función objetivo dada. Utilizado por los sistemas D-Wave a través de su software Ocean.",
  "qaoa": "QAOA",
  "qaoa-details": "Algoritmo de Optimización Aproximada Cuántica. Un método híbrido cuántico-clásico que discretiza el recocido cuántico.",
  "vqe": "VQE",
  "vqe-details": "Eigensolver Cuántico Variacional. Encuentra estados fundamentales de hamiltonianos, útil para problemas moleculares como H2. VQD es para estados excitados.",
  "gas": "Búsqueda Adaptativa de Grover",
  "gas-details": "Una técnica de optimización que utiliza el algoritmo de búsqueda de Grover para encontrar el mínimo de una función.",
  "qml": "Aprendizaje Automático Cuántico (QML)",
  "qml-details": "",
  "qml-def": "Definición de QML",
  "qml-def-details": "Un campo que explora la intersección de la computación cuántica y el aprendizaje automático clásico.",
  "feature-maps": "Mapas de Características",
  "feature-maps-details": "Técnicas para codificar datos clásicos en estados cuánticos (por ejemplo, Codificación de Ángulo, AmplitudeEmbedding, ZZFeatureMap).",
  "qsvm": "QSVM",
  "qsvm-details": "Máquinas de Vectores de Soporte Cuánticas. Utiliza una computadora cuántica para estimar la función del kernel, ofreciendo potencialmente aceleraciones.",
  "qnn": "QNN",
  "qnn-details": "Redes Neuronales Cuánticas. Análogos de las redes neuronales clásicas que utilizan circuitos cuánticos parametrizados (formas variacionales) como TwoLocal o StronglyEntanglingLayers.",
  "hybrid-arch": "Arquitecturas Híbridas",
  "hybrid-arch-details": "Combinación de componentes cuánticos y clásicos. Ejemplos: PennyLane con TensorFlow, Qiskit con PyTorch.",
  "qgan": "QGAN",
  "qgan-details": "Redes Generativas Adversarias Cuánticas. Versiones cuánticas de GANs para tareas de generación no supervisadas.",
  "foundational-algos": "Algoritmos Fundamentales",
  "foundational-algos-details": "",
  "deutsch-jozsa": "Deutsch-Jozsa",
  "deutsch-jozsa-details": "Uno de los primeros algoritmos en demostrar una aceleración cuántica exponencial sobre los algoritmos clásicos para un problema específico.",
  "grover": "Algoritmo de Grover",
  "grover-details": "Proporciona una aceleración cuadrática para problemas de búsqueda no estructurados a través de la amplificación de amplitud.",
  "qft": "Transformada Cuántica de Fourier",
  "qft-details": "Una subrutina clave en muchos algoritmos cuánticos importantes, incluyendo el algoritmo de Shor y la estimación de fase.",
  "qpe": "Estimación de Fase Cuántica",
  "qpe-details": "Utiliza la QFT para estimar los valores propios de un operador unitario, un paso crucial para muchos otros algoritmos.",
  "hardware": "Hardware e Infraestructura Cuántica",
  "hardware-details": "",
  "qubit-tech": "Tecnologías de Qubits",
  "qubit-tech-details": "Diferentes implementaciones físicas de qubits, incluyendo Superconductores (Transmons), Qubits de Spin y Iones/Átomos Atrapados.",
  "hw-arch": "Arquitectura de Hardware",
  "hw-arch-details": "Incluye electrónica de control, cableado criogénico y empaquetado para procesadores multichip y acopladores (acopladores C, L, M).",
  "challenges": "Desafíos",
  "challenges-details": "Los principales obstáculos incluyen la decoherencia (ruido), la conectividad limitada de los qubits, la poca profundidad de los circuitos y las mesetas estériles en el entrenamiento.",
  "error-correction": "Corrección de Errores",
  "error-correction-details": "Técnicas como los Códigos de Superficie y los códigos LDPC tienen como objetivo crear computadoras cuánticas tolerantes a fallos, un objetivo principal para la industria.",
  "processors": "Procesadores Clave",
  "processors-details": "Los procesadores cuánticos notables incluyen Eagle (127 qubits) y Heron (133 qubits) de IBM, y sistemas de Quantinuum y Atom Computing.",
  "software": "Software y Herramientas Cuánticas",
  "software-details": "",
  "frameworks": "Marcos de Programación",
  "frameworks-details": "Librerías de alto nivel para construir y ejecutar circuitos cuánticos. Los actores clave son Qiskit y PennyLane.",
  "qiskit": "Qiskit",
  "qiskit-details": "Un SDK de código abierto de IBM para trabajar con computadoras cuánticas. Incluye Terra, Aer, Nature, y módulos para ML y Optimización.",
  "pennylane": "PennyLane",
  "pennylane-details": "Una librería para programación cuántica diferenciable, que conecta circuitos cuánticos con marcos de ML como PyTorch y TensorFlow.",
  "other-tools": "Otras Herramientas",
  "other-tools-details": "Ocean de D-Wave (para recocido), Amazon Braket, Microsoft QDK (Q#), Google Cirq y el simulador visual Quirk.",
  "classical-libs": "Librerías Clásicas Integradas",
  "classical-libs-details": "Los marcos cuánticos se integran perfectamente con herramientas de ML clásicas como TensorFlow, PyTorch, scikit-learn, NumPy y Matplotlib.",
  "learning": "Aprendizaje y Aplicación Práctica",
  "learning-details": "",
  "book-philosophy": "Enfoque Práctico",
  "book-philosophy-details": "Se centra en la comprensión a través de una combinación de teoría y ejemplos de código prácticos.",
  "sim-vs-real": "Simuladores vs. Hardware Real",
  "sim-vs-real-details": "La mayoría de los marcos permiten que los algoritmos se prueben en simuladores locales antes de enviarse a hardware cuántico real en la nube.",
  "open-source": "Código Abierto",
  "open-source-details": "La disponibilidad de herramientas gratuitas y de código abierto como Qiskit y PennyLane es crucial para el crecimiento de la comunidad cuántica.",
  "future": "Conceptos Clave y Perspectivas Futuras",
  "future-details": "",
  "nisq": "Era NISQ",
  "nisq-details": "Cuántico de Escala Intermedia Ruidoso. La era actual, centrada en encontrar aplicaciones para computadoras cuánticas con 50-100 qubits ruidosos.",
  "vqa": "Algoritmos Cuánticos Variacionales",
  "vqa-details": "Una clase de algoritmos híbridos (como VQE, QAOA) que son centrales en la era NISQ debido a su resistencia al ruido.",
  "complexity": "Complejidad Computacional",
  "complexity-details": "Las computadoras cuánticas prometen resolver ciertos problemas (como la factorización) que son intratables para las computadoras clásicas, explorando clases más allá de P y NP.",
  "future-qc": "El Futuro de la QC",
  "future-qc-details": "El enfoque está en escalar el número de qubits, mejorar la calidad a través de la corrección de errores y descubrir nuevas aplicaciones prácticas.",
  "learn-more": "Aprender Más"
}